QX-C2000-DSP/f280049revb_evb_examples/libs/driverlib/pin_map.h
#ifndef __PIN_MAP_H__
#define __PIN_MAP_H__

//*****************************************************************************
// 0x00000003 = MUX register value
// 0x0000000C = GMUX register value
// 0x0000FF00 = Shift amount within mux registers
// 0xFFFF0000 = Offset of MUX register
//*****************************************************************************

#define GPIO_0_GPIO0    0x000C0000U
#define GPIO_0_EPWM1_A  0x000C0001U
#define GPIO_0_QSPIA    0x000C0002U
#define GPIO_0_I2CA_SDA 0x000C0006U
#define GPIO_0_XWE0     0x000C000EU

#define GPIO_1_GPIO1    0x000C0200U
#define GPIO_1_EPWM1_B  0x000C0201U
#define GPIO_1_QSPIA    0x000C0202U
#define GPIO_1_I2CA_SCL 0x000C0206U
#define GPIO_1_XR_W     0x000C020EU

#define GPIO_2_GPIO2       0x000C0400U
#define GPIO_2_EPWM2_A     0x000C0401U
#define GPIO_2_OUTPUTXBAR1 0x000C0405U
#define GPIO_2_PMBUSA_SDA  0x000C0406U
#define GPIO_2_SCIA_TX     0x000C0409U
#define GPIO_2_FSIRXA_D1   0x000C040AU
#define GPIO_2_XZCS0       0x000C040EU

#define GPIO_3_GPIO3       0x000C0600U
#define GPIO_3_EPWM2_B     0x000C0601U
#define GPIO_3_OUTPUTXBAR2 0x000C0602U
#define GPIO_3_PMBUSA_SCL  0x000C0606U
#define GPIO_3_SPIA_CLK    0x000C0607U
#define GPIO_3_SCIA_RX     0x000C0609U
#define GPIO_3_FSIRXA_D0   0x000C060AU
#define GPIO_3_XZCS6       0x000C060EU

#define GPIO_4_GPIO4       0x000C0800U
#define GPIO_4_EPWM3_A     0x000C0801U
#define GPIO_4_QSPIA       0x000C0802U
#define GPIO_4_OUTPUTXBAR3 0x000C0805U
#define GPIO_4_CANA_TX     0x000C0806U
#define GPIO_4_FSIRXA_CLK  0x000C080AU
#define GPIO_4_XZCS7       0x000C080EU

#define GPIO_5_GPIO5       0x000C0A00U
#define GPIO_5_EPWM3_B     0x000C0A01U
#define GPIO_5_OUTPUTXBAR3 0x000C0A03U
#define GPIO_5_CANA_RX     0x000C0A06U
#define GPIO_5_SPIA_STE    0x000C0A07U
#define GPIO_5_FSITXA_D1   0x000C0A09U
#define GPIO_5_XHOLDA      0x000C0A0EU

#define GPIO_6_GPIO6       0x000C0C00U
#define GPIO_6_EPWM4_A     0x000C0C01U
#define GPIO_6_OUTPUTXBAR4 0x000C0C02U
#define GPIO_6_SYNCOUT     0x000C0C03U
#define GPIO_6_EQEP1_A     0x000C0C05U
#define GPIO_6_CANB_TX     0x000C0C06U
#define GPIO_6_SPIB_SOMI   0x000C0C07U
#define GPIO_6_FSITXA_D0   0x000C0C09U
#define GPIO_6_XREADY      0x000C0C0EU

#define GPIO_7_GPIO7       0x000C0E00U
#define GPIO_7_EPWM4_B     0x000C0E01U
#define GPIO_7_OUTPUTXBAR5 0x000C0E03U
#define GPIO_7_EQEP1_B     0x000C0E05U
#define GPIO_7_CANB_RX     0x000C0E06U
#define GPIO_7_SPIB_SIMO   0x000C0E07U
#define GPIO_7_FSITXA_CLK  0x000C0E09U
#define GPIO_7_XHOLD       0x000C0E0EU

#define GPIO_8_GPIO8        0x000C1000U
#define GPIO_8_EPWM5_A      0x000C1001U
#define GPIO_8_CANB_TX      0x000C1002U
#define GPIO_8_ADCSOCAO     0x000C1003U
#define GPIO_8_EQEP1_STROBE 0x000C1005U
#define GPIO_8_SCIA_TX      0x000C1006U
#define GPIO_8_SPIA_SIMO    0x000C1007U
#define GPIO_8_I2CA_SCL     0x000C1009U
#define GPIO_8_FSITXA_D1    0x000C100AU
#define GPIO_8_EM1DQM0      0x000C100EU

#define GPIO_9_GPIO9       0x000C1200U
#define GPIO_9_EPWM5_B     0x000C1201U
#define GPIO_9_SCIB_TX     0x000C1202U
#define GPIO_9_OUTPUTXBAR6 0x000C1203U
#define GPIO_9_EQEP1_INDEX 0x000C1205U
#define GPIO_9_SCIA_RX     0x000C1206U
#define GPIO_9_SPIA_CLK    0x000C1207U
#define GPIO_9_FSITXA_D0   0x000C120AU
#define GPIO_9_EM1DQM3     0x000C120EU

#define GPIO_10_GPIO10     0x000C1400U
#define GPIO_10_EPWM6_A    0x000C1401U
#define GPIO_10_CANB_RX    0x000C1402U
#define GPIO_10_ADCSOCBO   0x000C1403U
#define GPIO_10_EQEP1_A    0x000C1405U
#define GPIO_10_SCIB_TX    0x000C1406U
#define GPIO_10_SPIA_SOMI  0x000C1407U
#define GPIO_10_I2CA_SDA   0x000C1409U
#define GPIO_10_FSITXA_CLK 0x000C140AU
#define GPIO_10_SOE        0x000C140EU

#define GPIO_11_GPIO11      0x000C1600U
#define GPIO_11_EPWM6_B     0x000C1601U
#define GPIO_11_SCIB_RX     0x000C1602U
#define GPIO_11_OUTPUTXBAR7 0x000C1603U
#define GPIO_11_EQEP1_B     0x000C1605U
#define GPIO_11_SPIA_STE    0x000C1607U
#define GPIO_11_FSIRXA_D1   0x000C1609U
#define GPIO_11_XZCS0       0x000C160EU

#define GPIO_12_GPIO12       0x000C1800U
#define GPIO_12_EPWM7_A      0x000C1801U
#define GPIO_12_CANB_TX      0x000C1802U
#define GPIO_12_QSPIB        0x000C1803U
#define GPIO_12_EQEP1_STROBE 0x000C1805U
#define GPIO_12_SCIB_TX      0x000C1806U
#define GPIO_12_PMBUSA_CTL   0x000C1807U
#define GPIO_12_FSIRXA_D0    0x000C1809U
#define GPIO_12_XZCS6        0x000C180EU

#define GPIO_13_GPIO13       0x000C1A00U
#define GPIO_13_EPWM7_B      0x000C1A01U
#define GPIO_13_CANB_RX      0x000C1A02U
#define GPIO_13_QSPIB        0x000C1A03U
#define GPIO_13_EQEP1_INDEX  0x000C1A05U
#define GPIO_13_SCIB_RX      0x000C1A06U
#define GPIO_13_PMBUSA_ALERT 0x000C1A07U
#define GPIO_13_FSIRXA_CLK   0x000C1A09U
#define GPIO_13_XZCS7        0x000C1A0EU

#define GPIO_14_GPIO14      0x000C1C00U
#define GPIO_14_EPWM8_A     0x000C1C01U
#define GPIO_14_SCIB_TX     0x000C1C02U
#define GPIO_14_OUTPUTXBAR3 0x000C1C06U
#define GPIO_14_PMBUSA_SDA  0x000C1C07U
#define GPIO_14_SPIB_CLK    0x000C1C09U
#define GPIO_14_EQEP2_A     0x000C1C0AU
#define GPIO_14_XHOLDA      0x000C1C0EU

#define GPIO_15_GPIO15      0x000C1E00U
#define GPIO_15_EPWM8_B     0x000C1E01U
#define GPIO_15_SCIB_RX     0x000C1E02U
#define GPIO_15_QSPIB       0x000C1E03U
#define GPIO_15_OUTPUTXBAR4 0x000C1E06U
#define GPIO_15_PMBUSA_SCL  0x000C1E07U
#define GPIO_15_SPIB_STE    0x000C1E09U
#define GPIO_15_EQEP2_B     0x000C1E0AU
#define GPIO_15_EM1DQM0     0x000C1E0EU

#define GPIO_16_GPIO16       0x00100000U
#define GPIO_16_SPIA_SIMO    0x00100001U
#define GPIO_16_CANB_TX      0x00100002U
#define GPIO_16_OUTPUTXBAR7  0x00100003U
#define GPIO_16_EPWM5_A      0x00100005U
#define GPIO_16_SCIA_TX      0x00100006U
#define GPIO_16_SD1_D1       0x00100007U
#define GPIO_16_EQEP1_STROBE 0x00100009U
#define GPIO_16_PMBUSA_SCL   0x0010000AU
#define GPIO_16_XCLKOUT      0x0010000BU
#define GPIO_16_XHOLDA       0x0010000EU

#define GPIO_17_GPIO17      0x00100200U
#define GPIO_17_SPIA_SOMI   0x00100201U
#define GPIO_17_CANB_RX     0x00100202U
#define GPIO_17_OUTPUTXBAR8 0x00100203U
#define GPIO_17_EPWM5_B     0x00100205U
#define GPIO_17_SCIA_RX     0x00100206U
#define GPIO_17_SD1_C1      0x00100207U
#define GPIO_17_EQEP1_INDEX 0x00100209U
#define GPIO_17_PMBUSA_SDA  0x0010020AU
#define GPIO_17_XREADY      0x0010020EU
#define GPIO_17_SOE         0x0010020FU

#define GPIO_18_GPIO18_X2  0x00100400U
#define GPIO_18_SPIA_CLK   0x00100401U
#define GPIO_18_SCIB_TX    0x00100402U
#define GPIO_18_CANA_RX    0x00100403U
#define GPIO_18_EPWM6_A    0x00100405U
#define GPIO_18_I2CA_SCL   0x00100406U
#define GPIO_18_SD1_D2     0x00100407U
#define GPIO_18_EQEP2_A    0x00100409U
#define GPIO_18_PMBUSA_CTL 0x0010040AU
#define GPIO_18_XCLKOUT    0x0010040BU

#define GPIO_20_GPIO20 0x00100800U

#define GPIO_21_GPIO21 0x00100A00U

#define GPIO_22_GPIO22_VFBSW 0x00100C00U
#define GPIO_22_EQEP1_STROBE 0x00100C01U
#define GPIO_22_SCIB_TX      0x00100C03U
#define GPIO_22_SPIB_CLK     0x00100C06U
#define GPIO_22_SD1_D4       0x00100C07U
#define GPIO_22_LINA_TX      0x00100C09U
#define GPIO_22_SCIC_TX      0x00100C09U
#define GPIO_22_XHOLD        0x00100C0EU

#define GPIO_23_GPIO23_VSW 0x00100E00U
#define GPIO_23_GPIO23     0x00100E04U

#define GPIO_24_GPIO24      0x00101000U
#define GPIO_24_OUTPUTXBAR1 0x00101001U
#define GPIO_24_EQEP2_A     0x00101002U
#define GPIO_24_EPWM8_A     0x00101005U
#define GPIO_24_SPIB_SIMO   0x00101006U
#define GPIO_24_SD1_D1      0x00101007U
#define GPIO_24_PMBUSA_SCL  0x0010100AU
#define GPIO_24_SCIA_TX     0x0010100BU
#define GPIO_24_ERRORSTS    0x0010100DU
#define GPIO_24_XHOLD       0x0010100EU

#define GPIO_25_GPIO25      0x00101200U
#define GPIO_25_OUTPUTXBAR2 0x00101201U
#define GPIO_25_EQEP2_B     0x00101202U
#define GPIO_25_SPIB_SOMI   0x00101206U
#define GPIO_25_SD1_C1      0x00101207U
#define GPIO_25_FSITXA_D1   0x00101209U
#define GPIO_25_PMBUSA_SDA  0x0010120AU
#define GPIO_25_SCIA_RX     0x0010120BU
#define GPIO_25_XHOLDA      0x0010120EU

#define GPIO_26_GPIO26        0x00101400U
#define GPIO_26_OUTPUTXBAR3   0x00101401U
#define GPIO_26_EQEP2_INDEX   0x00101402U
#define GPIO_26_CAN0_STBY     0x00101403U
#define GPIO_26_OUTPUTXBAR3_2 0x00101405U
#define GPIO_26_SPIB_CLK      0x00101406U
#define GPIO_26_SD1_D2        0x00101407U
#define GPIO_26_FSITXA_D0     0x00101409U
#define GPIO_26_PMBUSA_CTL    0x0010140AU
#define GPIO_26_I2CA_SDA      0x0010140BU
#define GPIO_26_XREADY        0x0010140EU
#define GPIO_26_SOE           0x0010140FU

#define GPIO_27_GPIO27       0x00101600U
#define GPIO_27_OUTPUTXBAR4  0x00101601U
#define GPIO_27_EQEP2_STROBE 0x00101602U
#define GPIO_27_CAN1_STBY    0x00101603U
#define GPIO_27_SPIB_STE     0x00101606U
#define GPIO_27_SD1_C2       0x00101607U
#define GPIO_27_FSITXA_CLK   0x00101609U
#define GPIO_27_PMBUSA_ALERT 0x0010160AU
#define GPIO_27_I2CA_SCL     0x0010160BU
#define GPIO_27_XHOLD        0x0010160EU

#define GPIO_28_GPIO28       0x00101800U
#define GPIO_28_SCIA_RX      0x00101801U
#define GPIO_28_CAN1_STBY    0x00101802U
#define GPIO_28_EPWM7_A      0x00101803U
#define GPIO_28_OUTPUTXBAR5  0x00101805U
#define GPIO_28_EQEP1_A      0x00101806U
#define GPIO_28_SD1_D3       0x00101807U
#define GPIO_28_EQEP2_STROBE 0x00101809U
#define GPIO_28_LINA_TX      0x0010180AU
#define GPIO_28_SCIC_TX      0x0010180AU
#define GPIO_28_SPIB_CLK     0x0010180BU
#define GPIO_28_ERRORSTS     0x0010180DU
#define GPIO_28_XHOLDA       0x0010180EU

#define GPIO_29_GPIO29      0x00101A00U
#define GPIO_29_SCIA_TX     0x00101A01U
#define GPIO_29_CAN1_STBY   0x00101A02U
#define GPIO_29_EPWM7_B     0x00101A03U
#define GPIO_29_OUTPUTXBAR6 0x00101A05U
#define GPIO_29_EQEP1_B     0x00101A06U
#define GPIO_29_SD1_C3      0x00101A07U
#define GPIO_29_EQEP2_INDEX 0x00101A09U
#define GPIO_29_LINA_RX     0x00101A0AU
#define GPIO_29_SCIC_RX     0x00101A0AU
#define GPIO_29_SPIB_STE    0x00101A0BU
#define GPIO_29_ERRORSTS    0x00101A0DU
#define GPIO_29_XREADY      0x00101A0EU
#define GPIO_29_SOE         0x00101A0FU

#define GPIO_30_GPIO30       0x00101C00U
#define GPIO_30_CANA_RX      0x00101C01U
#define GPIO_30_EPWM9_A      0x00101C02U
#define GPIO_30_SPIB_SIMO    0x00101C03U
#define GPIO_30_OUTPUTXBAR7  0x00101C05U
#define GPIO_30_EQEP1_STROBE 0x00101C06U
#define GPIO_30_SD1_D4       0x00101C07U
#define GPIO_30_XWE0         0x00101C0EU

#define GPIO_31_GPIO31      0x00101E00U
#define GPIO_31_CANA_TX     0x00101E01U
#define GPIO_31_EPWM9_B     0x00101E02U
#define GPIO_31_SPIB_SOMI   0x00101E03U
#define GPIO_31_OUTPUTXBAR8 0x00101E05U
#define GPIO_31_EQEP1_INDEX 0x00101E06U
#define GPIO_31_SD1_C4      0x00101E07U
#define GPIO_31_FSIRXA_D1   0x00101E09U
#define GPIO_31_XR_W        0x00101E0EU

#define GPIO_32_GPIO32    0x005C0000U
#define GPIO_32_I2CA_SDA  0x005C0001U
#define GPIO_32_SPIB_CLK  0x005C0003U
#define GPIO_32_EPWM8_B   0x005C0005U
#define GPIO_32_LINA_TX   0x005C0006U
#define GPIO_32_SCIC_TX   0x005C0006U
#define GPIO_32_SD1_D3    0x005C0007U
#define GPIO_32_FSIRXA_D0 0x005C0009U
#define GPIO_32_CANA_TX   0x005C000AU
#define GPIO_32_XHOLD     0x005C000EU

#define GPIO_33_GPIO33      0x005C0200U
#define GPIO_33_I2CA_SCL    0x005C0201U
#define GPIO_33_SPIB_STE    0x005C0203U
#define GPIO_33_OUTPUTXBAR4 0x005C0205U
#define GPIO_33_LINA_RX     0x005C0206U
#define GPIO_33_SCIC_RX     0x005C0206U
#define GPIO_33_SD1_C3      0x005C0207U
#define GPIO_33_FSIRXA_CLK  0x005C0209U
#define GPIO_33_CANA_RX     0x005C020AU
#define GPIO_33_XHOLDA      0x005C020EU

#define GPIO_34_GPIO34      0x005C0400U
#define GPIO_34_OUTPUTXBAR1 0x005C0401U
#define GPIO_34_QSPIB       0x005C0402U
#define GPIO_34_CAN0_STBY   0x005C0403U
#define GPIO_34_PMBUSA_SDA  0x005C0406U
#define GPIO_34_XREADY      0x005C040EU
#define GPIO_34_SOE         0x005C040FU

#define GPIO_35_GPIO35     0x005C0600U
#define GPIO_35_SCIA_RX    0x005C0601U
#define GPIO_35_I2CA_SDA   0x005C0603U
#define GPIO_35_CANA_RX    0x005C0605U
#define GPIO_35_PMBUSA_SCL 0x005C0606U
#define GPIO_35_LINA_RX    0x005C0607U
#define GPIO_35_SCIC_RX    0x005C0607U
#define GPIO_35_EQEP1_A    0x005C0609U
#define GPIO_35_PMBUSA_CTL 0x005C060AU
#define GPIO_35_TDI        0x005C060FU
#define GPIO_35_XHOLD      0x005C060EU

#define GPIO_37_GPIO37       0x005C0A00U
#define GPIO_37_OUTPUTXBAR2  0x005C0A01U
#define GPIO_37_QSPIA        0x005C0A02U
#define GPIO_37_I2CA_SCL     0x005C0A03U
#define GPIO_37_SCIA_TX      0x005C0A05U
#define GPIO_37_CANA_TX      0x005C0A06U
#define GPIO_37_LINA_TX      0x005C0A07U
#define GPIO_37_SCIC_TX      0x005C0A07U
#define GPIO_37_EQEP1_B      0x005C0A09U
#define GPIO_37_PMBUSA_ALERT 0x005C0A0AU
#define GPIO_37_XHOLDA       0x005C0A0EU
#define GPIO_37_TDO          0x005C0A0FU

#define GPIO_39_GPIO39     0x005C0E00U
#define GPIO_39_EPWM10_A   0x005C0E02U
#define GPIO_39_CANB_RX    0x005C0E06U
#define GPIO_39_FSIRXA_CLK 0x005C0E07U
#define GPIO_39_EM1DQM1    0x005C0E0EU

#define GPIO_40_GPIO40     0x005C1000U
#define GPIO_40_CAN0_STBY  0x005C1001U
#define GPIO_40_EPWM10_B   0x005C1002U
#define GPIO_40_PMBUSA_SDA 0x005C1006U
#define GPIO_40_FSIRXA_D0  0x005C1007U
#define GPIO_40_SCIB_TX    0x005C1009U
#define GPIO_40_EQEP1_A    0x005C100AU
#define GPIO_40_EM1DQM2    0x005C100EU

#define GPIO_41_GPIO41    0x005C1200U
#define GPIO_41_SPIA_CLK  0x005C1201U
#define GPIO_41_SCIB_TX   0x005C1202U
#define GPIO_41_CANA_RX   0x005C1203U
#define GPIO_41_EPWM6_A   0x005C1205U
#define GPIO_41_I2CA_SCL  0x005C1206U
#define GPIO_41_SD1_D2    0x005C1207U
#define GPIO_41_EQEP2_A   0x005C1209U
#define GPIO_41_PMBUS_CTL 0x005C120AU
#define GPIO_41_XCLKOUT   0x005C120BU
#define GPIO_41_XREADY    0x005C120EU
#define GPIO_41_SOE       0x005C120FU

#define GPIO_42_GPIO42       0x005C1400U
#define GPIO_42_EQEP1_STROBE 0x005C1401U
#define GPIO_42_SCIB_TX      0x005C1403U
#define GPIO_42_SPIB_CLK     0x005C1406U
#define GPIO_42_SD1_D4       0x005C1407U
#define GPIO_42_LINA_TX      0x005C1409U
#define GPIO_42_SCIC_TX      0x005C1409U
#define GPIO_42_XHOLD        0x005C140EU

#define GPIO_43_GPIO43 0x005C1600U
#define GPIO_44_GPIO44 0x005C1800U
#define GPIO_45_GPIO45 0x005C1A00U
#define GPIO_46_GPIO46 0x005C1C00U
#define GPIO_47_GPIO47 0x005C1E00U
#define GPIO_48_GPIO48 0x00600000U
#define GPIO_49_GPIO49 0x00600200U
#define GPIO_50_GPIO50 0x00600400U
#define GPIO_51_GPIO51 0x00600600U
#define GPIO_52_GPIO52 0x00600800U
#define GPIO_53_GPIO53 0x00600A00U
#define GPIO_54_GPIO54 0x00600C00U
#define GPIO_55_GPIO55 0x00600E00U

#define GPIO_56_GPIO56       0x00601000U
#define GPIO_56_SPIA_CLK     0x00601001U
#define GPIO_56_EPWM11_A     0x00601002U
#define GPIO_56_EQEP2_STROBE 0x00601005U
#define GPIO_56_SCIB_TX      0x00601006U
#define GPIO_56_SD1_D3       0x00601007U
#define GPIO_56_SPIB_SIMO    0x00601009U
#define GPIO_56_EQEP1_A      0x0060100BU
#define GPIO_56_EM1WE        0x0060100EU

#define GPIO_57_GPIO57      0x00601200U
#define GPIO_57_SPIA_STE    0x00601201U
#define GPIO_57_EPWM11_B    0x00601202U
#define GPIO_57_EQEP2_INDEX 0x00601205U
#define GPIO_57_SCIB_RX     0x00601206U
#define GPIO_57_SD1_C3      0x00601207U
#define GPIO_57_SPIB_SOMI   0x00601209U
#define GPIO_57_EQEP1_B     0x0060120BU
#define GPIO_57_SADS_SRE    0x0060120EU

#define GPIO_58_GPIO58       0x00601400U
#define GPIO_58_EPWM12_A     0x00601402U
#define GPIO_58_OUTPUTXBAR1  0x00601405U
#define GPIO_58_SPIB_CLK     0x00601406U
#define GPIO_58_SD1_D4       0x00601407U
#define GPIO_58_LINA_TX      0x00601409U
#define GPIO_58_SCIC_TX      0x00601409U
#define GPIO_58_CANB_TX      0x0060140AU
#define GPIO_58_EQEP1_STROBE 0x0060140BU
#define GPIO_58_XREADY       0x0060140EU

#define GPIO_59_GPIO59      0x00601600U
#define GPIO_59_EPWM12_B    0x00601602U
#define GPIO_59_OUTPUTXBAR2 0x00601605U
#define GPIO_59_SPIB_STE    0x00601606U
#define GPIO_59_SD1_C4      0x00601607U
#define GPIO_59_LINA_RX     0x00601609U
#define GPIO_59_SCIC_RX     0x00601609U
#define GPIO_59_CANB_RX     0x0060160AU
#define GPIO_59_EQEP1_INDEX 0x0060160BU
#define GPIO_59_XHOLD       0x0060160EU

#define GPIO_60_GPIO60    0x00601800U
#define GPIO_60_XD0       0x00601801U
#define GPIO_61_GPIO61    0x00601A00U
#define GPIO_61_XD1       0x00601A01U
#define GPIO_62_GPIO62    0x00601C00U
#define GPIO_62_XD2       0x00601C01U
#define GPIO_63_GPIO63    0x00601E00U
#define GPIO_63_XD3       0x00601E01U
#define GPIO_64_GPIO64    0x00AC0000U
#define GPIO_64_XD4       0x00AC0001U
#define GPIO_65_GPIO65    0x00AC0200U
#define GPIO_65_XD5       0x00AC0201U
#define GPIO_66_GPIO66    0x00AC0400U
#define GPIO_66_XD6       0x00AC0401U
#define GPIO_67_GPIO67    0x00AC0600U
#define GPIO_67_XD7       0x00AC0601U
#define GPIO_68_GPIO68    0x00AC0800U
#define GPIO_68_XD8       0x00AC0801U
#define GPIO_69_GPIO69    0x00AC0A00U
#define GPIO_69_XD9       0x00AC0A01U
#define GPIO_70_GPIO70    0x00AC0C00U
#define GPIO_70_XD10      0x00AC0C01U
#define GPIO_71_GPIO71    0x00AC0E00U
#define GPIO_71_XD11      0x00AC0E01U
#define GPIO_72_GPIO72    0x00AC1000U
#define GPIO_72_XD12      0x00AC1001U
#define GPIO_73_GPIO73    0x00AC1200U
#define GPIO_73_XD13      0x00AC1201U
#define GPIO_74_GPIO74    0x00AC1400U
#define GPIO_74_XD14      0x00AC1401U
#define GPIO_75_GPIO75    0x00AC1600U
#define GPIO_75_XD15      0x00AC1601U
#define GPIO_76_GPIO76    0x00AC1800U
#define GPIO_76_XD16      0x00AC1801U
#define GPIO_77_GPIO77    0x00AC1A00U
#define GPIO_77_XD17      0x00AC1A01U
#define GPIO_78_GPIO78    0x00AC1C00U
#define GPIO_78_XD18      0x00AC1C01U
#define GPIO_79_GPIO79    0x00AC1E00U
#define GPIO_79_XD19      0x00AC1E01U
#define GPIO_80_GPIO80    0x00B00000U
#define GPIO_80_XD20      0x00B00001U
#define GPIO_81_GPIO81    0x00B00200U
#define GPIO_81_XD21      0x00B00201U
#define GPIO_82_GPIO82    0x00B00400U
#define GPIO_82_XD22      0x00B00401U
#define GPIO_83_GPIO83    0x00B00600U
#define GPIO_83_XD23      0x00B00601U
#define GPIO_84_GPIO84    0x00B00800U
#define GPIO_84_XD24      0x00B00801U
#define GPIO_85_GPIO85    0x00B00A00U
#define GPIO_85_XD25      0x00B00A01U
#define GPIO_86_GPIO86    0x00B00C00U
#define GPIO_86_XD26      0x00B00C01U
#define GPIO_87_GPIO87    0x00B00E00U
#define GPIO_87_XD27      0x00B00E01U
#define GPIO_88_GPIO88    0x00B01000U
#define GPIO_88_XD28      0x00B01001U
#define GPIO_89_GPIO89    0x00B01200U
#define GPIO_89_XD29      0x00B01201U
#define GPIO_90_GPIO90    0x00B01400U
#define GPIO_90_XD30      0x00B01401U
#define GPIO_91_GPIO91    0x00B01600U
#define GPIO_91_XD31      0x00B01601U
#define GPIO_92_GPIO92    0x00B01800U
#define GPIO_92_XA1       0x00B01801U
#define GPIO_93_GPIO93    0x00B01A00U
#define GPIO_93_XA2       0x00B01A01U
#define GPIO_94_GPIO94    0x00B01C00U
#define GPIO_94_XA3       0x00B01C01U
#define GPIO_95_GPIO95    0x00B01E00U
#define GPIO_95_XA4       0x00B01E01U
#define GPIO_96_GPIO96    0x00FC0000U
#define GPIO_96_XA5       0x00FC0001U
#define GPIO_97_GPIO97    0x00FC0200U
#define GPIO_97_XA6       0x00FC0201U
#define GPIO_98_GPIO98    0x00FC0400U
#define GPIO_98_XA7       0x00FC0401U
#define GPIO_99_GPIO99    0x00FC0600U
#define GPIO_99_XA8       0x00FC0601U
#define GPIO_100_GPIO100  0x00FC0800U
#define GPIO_100_XA9      0x00FC0801U
#define GPIO_101_GPIO101  0x00FC0A00U
#define GPIO_101_XA10     0x00FC0A01U
#define GPIO_102_GPIO102  0x00FC0C00U
#define GPIO_102_XA11     0x00FC0C01U
#define GPIO_103_GPIO103  0x00FC0E00U
#define GPIO_103_XA12     0x00FC0E01U
#define GPIO_104_GPIO104  0x00FC1000U
#define GPIO_104_XA13     0x00FC1001U
#define GPIO_105_GPIO105  0x00FC1200U
#define GPIO_105_XA14     0x00FC1201U
#define GPIO_106_GPIO106  0x00FC1400U
#define GPIO_106_XA15     0x00FC1401U
#define GPIO_107_GPIO107  0x00FC1600U
#define GPIO_107_XA16     0x00FC1601U
#define GPIO_108_GPIO108  0x00FC1800U
#define GPIO_108_XA17     0x00FC1801U
#define GPIO_109_GPIO109  0x00FC1A00U
#define GPIO_109_XA18     0x00FC1A01U
#define GPIO_110_GPIO110  0x00FC1C00U
#define GPIO_110_XA19     0x00FC1C01U
#define GPIO_111_GPIO111  0x00FC1E00U
#define GPIO_111_XA0_XWE1 0x00FC1E01U
#define GPIO_112_GPIO112  0x01000000U
#define GPIO_112_XZCS0    0x01000001U
#define GPIO_113_GPIO113  0x01000200U
#define GPIO_113_XZCS6    0x01000201U
#define GPIO_114_GPIO114  0x01000400U
#define GPIO_114_XZCS7    0x01000401U
#define GPIO_115_GPIO115  0x01000600U
#define GPIO_115_EM1DQM0  0x01000601U
#define GPIO_116_GPIO116  0x01000800U
#define GPIO_116_EM1DQM1  0x01000801U
#define GPIO_117_GPIO117  0x01000A00U
#define GPIO_117_EM1DQM2  0x01000A01U
#define GPIO_118_GPIO118  0x01000C00U
#define GPIO_118_EM1DQM3  0x01000C01U
#define GPIO_119_GPIO119  0x01000E00U
#define GPIO_119_XWE0     0x01000E01U
#define GPIO_119_EM1WE    0x01000E02U
#define GPIO_120_GPIO120  0x01001000U
#define GPIO_120_XR_W     0x01001001U
#define GPIO_120_SADS_SRE 0x01001002U

#endif // PIN_MAP_H
